{
  "templateId": "6cc38b89-6087-49c5-9fcf-a9b8c2eca81d",
  "displayName": "ASR-Rules",
  "description": null,
  "settingsDelta": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "f7f7555a-c7a7-4a96-8e9a-0946476f54a4",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "97ff177e-b884-4124-a524-14f706321bbf",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "6a8aeb40-39a2-466b-86fe-201444a7ba8e",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
      "valueJson": "\"enable\"",
      "value": "enable"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "3975d52d-1d8c-4184-82d5-4ea3e43e9feb",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardMyFoldersType",
      "valueJson": "\"userDefined\"",
      "value": "userDefined"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "3f5ef819-bb68-42d3-9839-63c2736d30ed",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
      "valueJson": "\"enable\"",
      "value": "enable"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "50f4a0c8-4fdf-44fd-aadb-64326623fb12",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "308a3565-a94a-468b-8403-65cab5905aed",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
      "valueJson": "\"userDefined\"",
      "value": "userDefined"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "f7974271-279d-41ec-9afa-7b92b443460c",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "bcb014a3-8290-4b57-8712-8208f667a3a4",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "35b9a4b0-25e4-4fb4-aa80-83403c6c7964",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
      "valueJson": "\"block\"",
      "value": "block"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "d5fa5dba-ead3-43d1-a614-99fa92ffc18f",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
      "valueJson": "\"enable\"",
      "value": "enable"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "4e55cc0f-07a8-40c5-b93d-a43d27b958d9",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedExecutableType",
      "valueJson": "\"userDefined\"",
      "value": "userDefined"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "fc4e92ca-60cc-44fb-be94-b016350ba8ad",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
      "valueJson": "\"userDefined\"",
      "value": "userDefined"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "d0cea81a-a9cc-45f3-b3af-c7e400fc266b",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdvancedRansomewareProtectionType",
      "valueJson": "\"enable\"",
      "value": "enable"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "098e4fb4-830f-4288-bf5a-eb7a2417a6eb",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessCreationType",
      "valueJson": "\"block\"",
      "value": "block"
    }
  ]
}
