{
  "templateId": "2b595bcc-ef65-42ce-a0e3-67389ae50b8e",
  "displayName": "Bitlocker",
  "description": null,
  "settingsDelta": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "73f93d0c-0213-41e1-b947-1c709d1dab15",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
      "valueJson": "\"enabledForAzureAd\"",
      "value": "enabledForAzureAd"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "f69ee597-e70b-46b8-9322-3464e8bc53d5",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "5b4a4bf4-0dfe-4805-8452-46dee3fbf790",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
      "valueJson": "false",
      "value": false
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "9bcc7164-b07a-4413-bb1d-50750832e4da",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "232fb4eb-3124-49df-a832-7a434f6870f5",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
      "valueJson": "true",
      "value": true
    }
  ]
}
