{
  "templateId": "0f2b5d70-d4e9-4156-8c16-1397eb6c54a5",
  "displayName": "WHFB",
  "description": null,
  "settingsDelta": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "33081642-09d8-4b8b-bdac-03d399dbaee2",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "bee785a1-6a61-4db7-bd39-15a41fff4f18",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "c9cc902f-ffae-44a6-a608-16de6ec7f5e7",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "cfd09c97-efcc-4d2d-b1bd-3dfcb75385ef",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
      "valueJson": "\"enableWithUEFILock\"",
      "value": "enableWithUEFILock"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "16c72ec9-56aa-4bbf-913a-5d57c69d42b3",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled",
      "valueJson": "false",
      "value": false
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "3076ca86-6507-440d-9dc7-635f8e56e77e",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "3792e446-88c8-478a-aeed-78542012d022",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage",
      "valueJson": "\"notConfigured\"",
      "value": "notConfigured"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "c4b32188-0bfc-4ee5-9935-83ac1c5bc8e3",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage",
      "valueJson": "\"notConfigured\"",
      "value": "notConfigured"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "1c01f394-c33a-4579-8e89-95e073b5f403",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "id": "87762a10-640b-4d68-8699-daa2cf05d5b0",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength",
      "valueJson": "6",
      "value": 6
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "id": "7b151aa7-0bea-4788-825e-dc40ad725b17",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage",
      "valueJson": "\"notConfigured\"",
      "value": "notConfigured"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "id": "89ea395b-1ad9-4bed-b209-dc549cc87cc6",
      "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked",
      "valueJson": "false",
      "value": false
    }
  ]
}
